import numpy as np

####################################################
# np.mgrid[start:end:step]
# start: 开始坐标
# stop: 结束坐标
# step: 步长
# 步长为复数表示点数，左闭右闭
# 步长为实数表示间隔，左闭右开
####################################################
# np.c_[a, b]
# np.c_ 中的 c 是 column (列) 的缩写
# 就是按列叠加两个矩阵, 就是把两个矩阵左右组合, 要求行数相等
####################################################
# ravel()方法将数组维度拉成一维数组
####################################################
# 生成等间隔数值点, x, y 均为 2 行 4 列
# x 沿着水平向右的方向扩展(即: 每列都相同)
# y 沿着垂直向下的方向扩展(即: 每行都相同)
x, y = np.mgrid[1:3:1, 2:4:0.5]

# 将x, y拉直，并合并配对为二维张量，生成二维坐标点
grid = np.c_[x.ravel(), y.ravel()]
print("x:\n", x)
print("y:\n", y)
print("x.ravel():\n", x.ravel())
print("y.ravel():\n", y.ravel())
print('grid:\n', grid)


